# SetLayoutAsSingle Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarContainerItem..::..SetLayoutAsSingle Method
RebarContainerItem Class See Also
---
Sets the Layout Rule property of rebar set to Single.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public void SetLayoutAsSingle()
```

Visual Basic
---
```text
Public Sub SetLayoutAsSingle
```

Visual C++
---
```text
public:
void SetLayoutAsSingle()
```

# Remarks
Only one bar will remain, which is at the position of rebar plane
# See Also
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace